session3/cours/java-jpa.org
#+TITLE: Mapping objet-relationnel en Java : JPA et Hibernate
#+AUTHOR: Bernard Hugueney
#+DATE:

#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}

#+LaTeX_HEADER: \addtolength{\oddsidemargin}{-.475in}
#+LaTeX_HEADER:	\addtolength{\evensidemargin}{-.475in}
#+LaTeX_HEADER:	\addtolength{\textwidth}{1.75in}
#+LaTeX_HEADER:
#+LaTeX_HEADER:	\addtolength{\topmargin}{-1.75in}
#+LaTeX_HEADER:	\addtolength{\textheight}{2.75in}
#+LaTeX_HEADER: \usepackage{comment}

#+BEGIN_SRC elisp :exports none :results silent
(setq org-plantuml-jar-path "/usr/share/plantuml/plantuml.jar")
(org-babel-do-load-languages 'org-babel-load-languages '((ditaa . t)(plantuml . t))) 
  (add-to-list 'org-latex-packages-alist '("" "listings"))
  (add-to-list 'org-latex-packages-alist '("" "color"))
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)

  (setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "bibtex %b"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  (setq org-latex-minted-options '(("frame" "lines")
                                   ("fontsize" "\\scriptsize")
                                   ("xleftmargin" "\\parindent")
                                   ("linenos" "")))
(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.
(setq org-crypt-key nil)
#+END_SRC


* Principe

Lorsque l'on implémente un CRUD à partir de JDBC, l'implémentation des
DAO est extrêmement répétitive car toutes les entités doivent
permettre les même fonctionnalités de base :

- création de nouvelle entités destinées à être enregistrée dans la
  table associée à la classe
- construction d'objets partir des lignes de la table associée à la
  classe
- mise à jour des lignes de la table pour prendre en compte les
  modifications des objets lorsque les attributs de ceux-ci ont été
  modifiés
- suppression des lignes correspondant à des objets que l'on veut
  supprimer.


Les principales différences entre deux classes entités, sont :
- le nom de la table associée à la classe
- les noms et types des colonnes associées à chaque attributs


Dans le cas un peu plus complexe de l'implémentation de relations
entre entités, on doit aussi prendre en compte le type de relation
(1-1, 1-plusieurs, plusieurs-1, plusieurs-plusieurs, et si elles sont
unidirectionnelles ou bidirectionnelles) et identifier la table
d'association éventuelle ainsi que décider si le chargement des
entités associées doit être [[https://fr.wikipedia.org/wiki/%25C3%2589valuation_paresseuse][paresseux]] ([[https://en.wikipedia.org/wiki/Lazy_evaluation][lazy]]) ou non.

Si l'on pouvait /déclarer/ ces /paramètres/ l'implémentation de la
correspondance entre les classes entités et les tables pourrait être
automatisée. Il sera ainsi possible de manipuler les données de la
base en désignant les classes et attributs au lieu des tables et
colonnes correspondantes grâce à un /Domain Specific Language/
adapté : [[https://www.thoughts-on-java.org/jpql/][Java Persistence Query Language]] (/JPQL/).

Le fait d'utiliser JPQL plutôt que SQL nous permettra aussi, dans un
deuxième temps, de factoriser une partie des implémentations de nos /DAO/.


* JPA et Hibernate
La correspondance entre les tables des Systèmes de Bases de Données
Relationnels et les classes de la Programmation Orientée Objet permet
de définir un /Mapping Objet-Relationnel/. En Java, [[https://fr.wikipedia.org/wiki/Java_Persistence_API][JPA]] (Java
Persistence API) est la spécification standard et [[https://fr.wikipedia.org/wiki/Hibernate][Hibernate]] en est
l'implémentation la plus populaire (même si [[https://www.eclipse.org/eclipselink/][EclipseLink]] est
l'implémentation de référence). On a le même rapport entre
spécification et implémentation qu'entre des /interfaces/ et les
classes implémentant ces interface (ces classes peuvent aussi
implémenter plus que ce qui est spécifié par les interfaces).

Afin de ne pas dépendre d'une implémentation spécifique, on pourra
vouloir se restreindre à n'utiliser que ce qui est spécifié par /JPA/
même si l'on utilise /Hibernate/.


/JPA/ constitue *encore* une couche d'abstraction. En tant que telle,
elle ne sera pas vraiment utile pour de petits projets n'ayant pas
besoin d'évoluer. Le couplage avec le typage statique de Java procède
des mêmes avantages et inconvénients.

* Mise en œuvre

