session3/cours/java-jpa.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-12-09 Mon 13:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mapping objet-relationnel en Java : JPA et Hibernate</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bernard Hugueney" />
</head>
<body>
<div id="content">
<h1 class="title">Mapping objet-relationnel en Java : JPA et Hibernate</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7938402">1. Principe</a></li>
<li><a href="#orgebb6b16">2. JPA et Hibernate</a></li>
<li><a href="#orga3af5cb">3. Mise en œuvre</a>
<ul>
<li><a href="#org61ff623">3.1. Dépendances</a></li>
<li><a href="#org4becd20">3.2. Configuration XML</a></li>
<li><a href="#orgc38fb7e">3.3. Annotations</a></li>
</ul>
</li>
<li><a href="#orge55d48b">4. Utilisation</a>
<ul>
<li><a href="#org9ecd23e">4.1. Construction d'un EntityManager</a></li>
<li><a href="#org9256861">4.2. Utilisation d'EntityManager</a>
<ul>
<li><a href="#orgb9a5ef2">4.2.1. Création</a></li>
</ul>
</li>
<li><a href="#orgcb9f89f">4.3. Lecture</a></li>
<li><a href="#orgefe6dfa">4.4. Mise à jour</a></li>
<li><a href="#org1dba4b6">4.5. Suppression</a></li>
</ul>
</li>
<li><a href="#org6b71149">5. Pratique</a></li>
<li><a href="#org45594d5">6. Associations</a>
<ul>
<li><a href="#org601c05f">6.1. 1-N, N-1</a></li>
<li><a href="#org441089a">6.2. N-N</a></li>
</ul>
</li>
<li><a href="#org8182b56">7. Data Access Objects</a></li>
<li><a href="#org0365eff">8. Java Persistence Query Language</a>
<ul>
<li><a href="#org9e5bf28">8.1. Paramétrage</a></li>
<li><a href="#orgc8cf28e">8.2. Typage</a></li>
<li><a href="#org8aa4a8a">8.3. Définition statique</a></li>
</ul>
</li>
<li><a href="#org588191b">9. Mise en œuvre</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7938402" class="outline-2">
<h2 id="org7938402"><span class="section-number-2">1</span> Principe</h2>
<div class="outline-text-2" id="text-1">
<p>
Lorsque l'on implémente un CRUD à partir de JDBC, l'implémentation des
DAO est extrêmement répétitive car toutes les entités doivent
permettre les même fonctionnalités de base :
</p>

<ul class="org-ul">
<li>création de nouvelle entités destinées à être enregistrée dans la
table associée à la classe</li>
<li>construction d'objets partir des lignes de la table associée à la
classe</li>
<li>mise à jour des lignes de la table pour prendre en compte les
modifications des objets lorsque les attributs de ceux-ci ont été
modifiés</li>
<li>suppression des lignes correspondant à des objets que l'on veut
supprimer.</li>
</ul>


<p>
Les principales différences entre deux classes entités, sont :
</p>
<ul class="org-ul">
<li>le nom de la table associée à la classe</li>
<li>les noms et types des colonnes associées à chaque attributs</li>
</ul>


<p>
Dans le cas un peu plus complexe de l'implémentation de relations
entre entités, on doit aussi prendre en compte le type de relation
(1-1, 1-plusieurs, plusieurs-1, plusieurs-plusieurs, et si elles sont
unidirectionnelles ou bidirectionnelles) et identifier la table
d'association éventuelle ainsi que décider si le chargement des
entités associées doit être <a href="https://fr.wikipedia.org/wiki/%C3%89valuation_paresseuse">paresseux</a> (<a href="https://en.wikipedia.org/wiki/Lazy_evaluation">lazy</a>) ou non.
</p>

<p>
Si l'on pouvait <i>déclarer</i> ces <i>paramètres</i> l'implémentation de la
correspondance entre les classes entités et les tables pourrait être
automatisée. Il sera ainsi possible de manipuler les données de la
base en désignant les classes et attributs au lieu des tables et
colonnes correspondantes grâce à un <i>Domain Specific Language</i>
adapté : <a href="https://www.thoughts-on-java.org/jpql/">Java Persistence Query Language</a> (<i>JPQL</i>).
</p>

<p>
Le fait d'utiliser JPQL plutôt que SQL nous permettra aussi, dans un
deuxième temps, de factoriser une partie des implémentations de nos <i>DAO</i>.
</p>
</div>
</div>


<div id="outline-container-orgebb6b16" class="outline-2">
<h2 id="orgebb6b16"><span class="section-number-2">2</span> JPA et Hibernate</h2>
<div class="outline-text-2" id="text-2">
<p>
La correspondance entre les tables des Systèmes de Bases de Données
Relationnels et les classes de la Programmation Orientée Objet permet
de définir un <i>Mapping Objet-Relationnel</i>. En Java, <a href="https://fr.wikipedia.org/wiki/Java_Persistence_API">JPA</a> (Java
Persistence API) est la spécification standard et <a href="https://fr.wikipedia.org/wiki/Hibernate">Hibernate</a> en est
l'implémentation la plus populaire (même si <a href="https://www.eclipse.org/eclipselink/">EclipseLink</a> est
l'implémentation de référence). On a le même rapport entre
spécification et implémentation qu'entre des <i>interfaces</i> et les
classes implémentant ces interface (ces classes peuvent aussi
implémenter plus que ce qui est spécifié par les interfaces).
</p>

<p>
Afin de ne pas dépendre d'une implémentation spécifique, on pourra
vouloir se restreindre à n'utiliser que ce qui est spécifié par <i>JPA</i>
même si l'on utilise <i>Hibernate</i>.
</p>


<p>
<i>JPA</i> constitue <b>encore</b> une couche d'abstraction. En tant que telle,
elle ne sera pas vraiment utile pour de petits projets n'ayant pas
besoin d'évoluer. Le couplage avec le typage statique de Java procède
des mêmes avantages et inconvénients.
</p>
</div>
</div>
