session3/cours/java-jpa.md
- [Principe](#org0af3f71)
- [JPA et Hibernate](#orgea3180c)
- [Mise en œuvre](#org95054cb)
  - [Dépendances](#org39b5d1a)
  - [Configuration XML](#orgc79688a)
  - [Annotations](#org85ed308)
- [Utilisation](#org33f0fd1)
  - [Construction d'un EntityManager](#org5aef88d)
  - [Utilisation d'EntityManager](#org374a970)
    - [Création](#org2ca1563)
  - [Lecture](#org81dd4fb)
  - [Mise à jour](#org25c2319)
  - [Suppression](#orgb09bc17)
- [Pratique](#orged7cbca)
- [Associations](#orgbcca5dc)
  - [1-N, N-1](#orgda0bc05)
  - [N-N](#org29ad975)
- [Data Access Objects](#orgca40791)
- [Java Persistence Query Language](#org05f53e2)
  - [Paramétrage](#org5455380)
  - [Typage](#orga7519c4)
  - [Définition statique](#org14e50fb)
- [Mise en œuvre](#orgef1e6a3)



<a id="org0af3f71"></a>

# Principe

Lorsque l'on implémente un CRUD à partir de JDBC, l'implémentation des DAO est extrêmement répétitive car toutes les entités doivent permettre les même fonctionnalités de base :

-   création de nouvelle entités destinées à être enregistrée dans la table associée à la classe
-   construction d'objets partir des lignes de la table associée à la classe
-   mise à jour des lignes de la table pour prendre en compte les modifications des objets lorsque les attributs de ceux-ci ont été modifiés
-   suppression des lignes correspondant à des objets que l'on veut supprimer.

Les principales différences entre deux classes entités, sont :

-   le nom de la table associée à la classe
-   les noms et types des colonnes associées à chaque attributs

Dans le cas un peu plus complexe de l'implémentation de relations entre entités, on doit aussi prendre en compte le type de relation (1-1, 1-plusieurs, plusieurs-1, plusieurs-plusieurs, et si elles sont unidirectionnelles ou bidirectionnelles) et identifier la table d'association éventuelle ainsi que décider si le chargement des entités associées doit être [paresseux](https://fr.wikipedia.org/wiki/%C3%89valuation_paresseuse) ([lazy](https://en.wikipedia.org/wiki/Lazy_evaluation)) ou non.

Si l'on pouvait *déclarer* ces *paramètres* l'implémentation de la correspondance entre les classes entités et les tables pourrait être automatisée. Il sera ainsi possible de manipuler les données de la base en désignant les classes et attributs au lieu des tables et colonnes correspondantes grâce à un *Domain Specific Language* adapté : [Java Persistence Query Language](https://www.thoughts-on-java.org/jpql/) (*JPQL*).

Le fait d'utiliser JPQL plutôt que SQL nous permettra aussi, dans un deuxième temps, de factoriser une partie des implémentations de nos *DAO*.


<a id="orgea3180c"></a>

# JPA et Hibernate

La correspondance entre les tables des Systèmes de Bases de Données Relationnels et les classes de la Programmation Orientée Objet permet de définir un *Mapping Objet-Relationnel*. En Java, [JPA](https://fr.wikipedia.org/wiki/Java_Persistence_API) (Java Persistence API) est la spécification standard et [Hibernate](https://fr.wikipedia.org/wiki/Hibernate) en est l'implémentation la plus populaire (même si [EclipseLink](https://www.eclipse.org/eclipselink/) est l'implémentation de référence). On a le même rapport entre spécification et implémentation qu'entre des *interfaces* et les classes implémentant ces interface (ces classes peuvent aussi implémenter plus que ce qui est spécifié par les interfaces).

Afin de ne pas dépendre d'une implémentation spécifique, on pourra vouloir se restreindre à n'utiliser que ce qui est spécifié par *JPA* même si l'on utilise *Hibernate*.

*JPA* constitue **encore** une couche d'abstraction. En tant que telle, elle ne sera pas vraiment utile pour de petits projets n'ayant pas besoin d'évoluer. Le couplage avec le typage statique de Java procède des mêmes avantages et inconvénients.
