session3/cours/java-jpa.org
** Dépendances
On peut utiliser /JPA/ et /Hibernate/ dans le cadre de /frameworks/
(e.g. [[https://spring.io/guides/gs/accessing-data-jpa/][Spring]] boot, voire [[https://www.jhipster.tech/creating-an-entity/][JHipster]]), mais dans un premier temps, on
utilisera seulement/directement /JPA/ et /Hibernate/ dans un projet
/Maven/.

#+BEGIN_SRC nxml
<dependency>
    <groupId>org.postgresql</groupId>
    <artifactId>postgresql</artifactId>
    <version>42.2.8</version>
</dependency>

<dependency>
    <groupId>org.eclipse.persistence</groupId>
    <artifactId>javax.persistence</artifactId>
    <version>2.2.1</version>
</dependency>
<dependency>
    <groupId>org.hibernate</groupId>
    <artifactId>hibernate-core</artifactId>
    <version>5.4.9.Final</version>
</dependency>

#+END_SRC
** Configuration XML

Dans la structure standard d'un projet /Maven/, on ajoutera un
répertoire =META-INF= dans le répertoire =src/main/java= et dans ce
répertoire un fichier =persistence.xml= :
#+BEGIN_SRC XML
<persistence xmlns="http://xmlns.jcp.org/xml/ns/persistence" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xsi:schemaLocation="http://xmlns.jcp.org/xml/ns/persistence
             http://xmlns.jcp.org/xml/ns/persistence/persistence_2_1.xsd"
  version="2.1">
<persistence-unit name="demo-jpa-1" transaction-type="RESOURCE_LOCAL">
    <provider>org.hibernate.jpa.HibernatePersistenceProvider</provider>
		<class>co.simplon.patrimoine.model.City</class>
		<class>co.simplon.patrimoine.model.Monument</class>
    <properties>
        <property name="javax.persistence.jdbc.driver" value="org.postgresql.Driver" />
 
        <property name="javax.persistence.jdbc.url" value="jdbc:postgresql://localhost/postgres" /> <!-- !!! -->
        <property name="javax.persistence.jdbc.user" value="****" /> <!-- !!! --> 
        <property name="javax.persistence.jdbc.password" value="****" /> <!-- !!! -->
        
        <property name="hibernate.dialect" value="org.hibernate.dialect.PostgreSQL95Dialect"/> <!-- DB Dialect -->
        <property name="hibernate.hbm2ddl.auto" value="update" /> <!-- create / create-drop / update -->    
        <property name="hibernate.show_sql" value="true" /> <!-- Show SQL in console -->
        <property name="hibernate.format_sql" value="true" /> <!-- Show SQL formatted -->
    </properties>

</persistence-unit>
</persistence>
#+END_SRC

- Exercice :: Que penser des propriétés =javax.persistence.jdbc.url=
              et surtout =javax.persistence.jdbc.user= voire
              =javax.persistence.jdbc.password= ? Que proposez-vous ?

Les autres propriétés de configuration de JPA pourraient elles aussi
être exprimée en XML, [[https://dzone.com/articles/persisting-entity-classes][dans un fichier orm.xml]]. Mais comme elles sont
liées aux classes entités, on préférera les exprimer sous la forme
d'/annotations/.

