session3/cours/java-jpa.html

<div id="outline-container-orga3af5cb" class="outline-2">
<h2 id="orga3af5cb"><span class="section-number-2">3</span> Mise en œuvre</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org61ff623" class="outline-3">
<h3 id="org61ff623"><span class="section-number-3">3.1</span> Dépendances</h3>
<div class="outline-text-3" id="text-3-1">
<p>
On peut utiliser <i>JPA</i> et <i>Hibernate</i> dans le cadre de <i>frameworks</i>
(e.g. <a href="https://spring.io/guides/gs/accessing-data-jpa/">Spring</a> boot, voire <a href="https://www.jhipster.tech/creating-an-entity/">JHipster</a>), mais dans un premier temps, on
utilisera seulement/directement <i>JPA</i> et <i>Hibernate</i> dans un projet
<i>Maven</i>.
</p>

<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.postgresql&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;postgresql&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;42.2.8&lt;/<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;

&lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.eclipse.persistence&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;javax.persistence&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;2.2.1&lt;/<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
&lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.hibernate&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;hibernate-core&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;5.4.9.Final&lt;/<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;

</pre>
</div>
</div>
</div>
<div id="outline-container-org4becd20" class="outline-3">
<h3 id="org4becd20"><span class="section-number-3">3.2</span> Configuration XML</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Dans la structure standard d'un projet <i>Maven</i>, on ajoutera un
répertoire <code>META-INF</code> dans le répertoire <code>src/main/java</code> et dans ce
répertoire un fichier <code>persistence.xml</code> :
</p>
<div class="org-src-container">
<pre class="src src-XML">&lt;persistence xmlns="http://xmlns.jcp.org/xml/ns/persistence" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xsi:schemaLocation="http://xmlns.jcp.org/xml/ns/persistence
             http://xmlns.jcp.org/xml/ns/persistence/persistence_2_1.xsd"
  version="2.1"&gt;
&lt;persistence-unit name="demo-jpa-1" transaction-type="RESOURCE_LOCAL"&gt;
    &lt;provider&gt;org.hibernate.jpa.HibernatePersistenceProvider&lt;/provider&gt;
		&lt;class&gt;co.simplon.patrimoine.model.City&lt;/class&gt;
		&lt;class&gt;co.simplon.patrimoine.model.Monument&lt;/class&gt;
    &lt;properties&gt;
        &lt;property name="javax.persistence.jdbc.driver" value="org.postgresql.Driver" /&gt;
 
        &lt;property name="javax.persistence.jdbc.url" value="jdbc:postgresql://localhost/postgres" /&gt; &lt;!-- !!! --&gt;
        &lt;property name="javax.persistence.jdbc.user" value="****" /&gt; &lt;!-- !!! --&gt; 
        &lt;property name="javax.persistence.jdbc.password" value="****" /&gt; &lt;!-- !!! --&gt;
        
        &lt;property name="hibernate.dialect" value="org.hibernate.dialect.PostgreSQL95Dialect"/&gt; &lt;!-- DB Dialect --&gt;
        &lt;property name="hibernate.hbm2ddl.auto" value="update" /&gt; &lt;!-- create / create-drop / update --&gt;    
        &lt;property name="hibernate.show_sql" value="true" /&gt; &lt;!-- Show SQL in console --&gt;
        &lt;property name="hibernate.format_sql" value="true" /&gt; &lt;!-- Show SQL formatted --&gt;
    &lt;/properties&gt;

&lt;/persistence-unit&gt;
&lt;/persistence&gt;
</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Que penser des propriétés <code>javax.persistence.jdbc.url</code>
et surtout <code>javax.persistence.jdbc.user</code> voire
<code>javax.persistence.jdbc.password</code> ? Que proposez-vous ?</dd>
</dl>

<p>
Les autres propriétés de configuration de JPA pourraient elles aussi
être exprimée en XML, <a href="https://dzone.com/articles/persisting-entity-classes">dans un fichier orm.xml</a>. Mais comme elles sont
liées aux classes entités, on préférera les exprimer sous la forme
d'<i>annotations</i>.
</p>
</div>
</div>
