session3/cours/java-jpa.org
** Annotations
Dans les classes =co.simplon.patrimoine.model.City= et
=co.simplon.patrimoine.model.Monument=, on utilisera les annotations
suivantes :

- sur la classe :
  - [[https://docs.oracle.com/javaee/6/api/javax/persistence/Entity.html][javax.persistence.Entity]]
  - [[https://docs.oracle.com/javaee/7/api/javax/persistence/Table.html][javax.persistence.Table]]
- sur les attributs :
  - [[https://docs.oracle.com/javaee/7/api/javax/persistence/Id.html][javax.persistence.Id]] pour l'attribut correspondant à la clé
    primaire
  - [[https://docs.oracle.com/javaee/7/api/index.html?javax/persistence/GeneratedValue.html][javax.persistence.GeneratedValue]] toujours pour la clé
    primaire. Avec une valeur de [[https://docs.oracle.com/javaee/7/api/javax/persistence/GeneratedValue.html#strategy--][strategy]] à [[https://docs.oracle.com/javaee/7/api/javax/persistence/GenerationType.html#SEQUENCE][GenerationType.SEQUENCE]],
    dans le cas d'une clé primaire de type =SERIAL= sous
    postgresql, [[https://www.thoughts-on-java.org/hibernate-postgresql-5-things-need-know/][notamment pour des raisons de performance]].
  - [[https://docs.oracle.com/javaee/7/api/javax/persistence/Column.html][javax.persistence.Column]] pour chacun des attributs.


Sur les classes suivantes :
#+BEGIN_SRC java
  public class City {
      private Long id;
      private String name;
      private Double latitude;
      private Double longitude;

      public City() {
      }
      public City(String name, double latitude, double longitude) {
	  this(null, name, latitude, longitude);
      }
      public City(Long id, String name, double latitude, double longitude) {
	  this.id= id;
	  this.name= name;
	  this.latitude= latitude;
	  this.longitude= longitude;
      }
      public Long getId() {
	  return id;
      }

      public void setId(Long id) {
	  this.id = id;
      }

      public String getName() {
	  return name;
      }

      public void setName(String nom) {
	  this.name = nom;
      }

      public Double getLongitude() {
	  return this.longitude;
      }

      public void setLongitude(Double longitude) {
	  this.longitude = longitude;
      }

      public Double getLatitude() {
	  return this.latitude;
      }

      public void setLatitude(Double latitude) {
	  this.latitude = latitude;
      }

      @Override
      public String toString() {
	  return "City [id=" + id + ", name=" + name + ", latitude=" + latitude
	      + ", longitude=" + longitude + "]";
      }
  }

#+END_SRC
Cette classe doit être liée à une table nommée =CITIES= avec des
colonnes : 
- ID :: clé primaire de type =SERIAL=
- NAME :: 
- LATITUDE ::
- LONGITUDE :: 


- Exercice :: Indiquer que la valeur d'une colonne ne doit pas
              être =NULL= et qu'une chaîne de caractères doit avoir une
              taille limitée à 255 caractères ?

* Utilisation

