session3/cours/java-jpa.html

<div id="outline-container-orgc38fb7e" class="outline-3">
<h3 id="orgc38fb7e"><span class="section-number-3">3.3</span> Annotations</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Dans les classes <code>co.simplon.patrimoine.model.City</code> et
<code>co.simplon.patrimoine.model.Monument</code>, on utilisera les annotations
suivantes :
</p>

<ul class="org-ul">
<li>sur la classe :
<ul class="org-ul">
<li><a href="https://docs.oracle.com/javaee/6/api/javax/persistence/Entity.html">javax.persistence.Entity</a></li>
<li><a href="https://docs.oracle.com/javaee/7/api/javax/persistence/Table.html">javax.persistence.Table</a></li>
</ul></li>
<li>sur les attributs :
<ul class="org-ul">
<li><a href="https://docs.oracle.com/javaee/7/api/javax/persistence/Id.html">javax.persistence.Id</a> pour l'attribut correspondant à la clé
primaire</li>
<li><a href="https://docs.oracle.com/javaee/7/api/index.html?javax/persistence/GeneratedValue.html">javax.persistence.GeneratedValue</a> toujours pour la clé
primaire. Avec une valeur de <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/GeneratedValue.html#strategy--">strategy</a> à <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/GenerationType.html#SEQUENCE">GenerationType.SEQUENCE</a>,
dans le cas d'une clé primaire de type <code>SERIAL</code> sous
postgresql, <a href="https://www.thoughts-on-java.org/hibernate-postgresql-5-things-need-know/">notamment pour des raisons de performance</a>.</li>
<li><a href="https://docs.oracle.com/javaee/7/api/javax/persistence/Column.html">javax.persistence.Column</a> pour chacun des attributs.</li>
</ul></li>
</ul>


<p>
Sur les classes suivantes :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">City</span> {
      <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>;
      <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>;
      <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Double</span> <span style="color: #BA36A5;">latitude</span>;
      <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Double</span> <span style="color: #BA36A5;">longitude</span>;

      <span style="color: #0000FF;">public</span> <span style="color: #006699;">City</span>() {
      }
      <span style="color: #0000FF;">public</span> <span style="color: #006699;">City</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">latitude</span>, <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">longitude</span>) {
          <span style="color: #0000FF;">this</span>(<span style="color: #D0372D;">null</span>, name, latitude, longitude);
      }
      <span style="color: #0000FF;">public</span> <span style="color: #006699;">City</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>, <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">latitude</span>, <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">longitude</span>) {
          <span style="color: #0000FF;">this</span>.id= id;
          <span style="color: #0000FF;">this</span>.name= name;
          <span style="color: #0000FF;">this</span>.latitude= latitude;
          <span style="color: #0000FF;">this</span>.longitude= longitude;
      }
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">Long</span> <span style="color: #006699;">getId</span>() {
          <span style="color: #0000FF;">return</span> id;
      }

      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setId</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>) {
          <span style="color: #0000FF;">this</span>.id = id;
      }

      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">getName</span>() {
          <span style="color: #0000FF;">return</span> name;
      }

      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setName</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">nom</span>) {
          <span style="color: #0000FF;">this</span>.name = nom;
      }

      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">Double</span> <span style="color: #006699;">getLongitude</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">this</span>.longitude;
      }

      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setLongitude</span>(<span style="color: #6434A3;">Double</span> <span style="color: #BA36A5;">longitude</span>) {
          <span style="color: #0000FF;">this</span>.longitude = longitude;
      }

      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">Double</span> <span style="color: #006699;">getLatitude</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">this</span>.latitude;
      }

      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setLatitude</span>(<span style="color: #6434A3;">Double</span> <span style="color: #BA36A5;">latitude</span>) {
          <span style="color: #0000FF;">this</span>.latitude = latitude;
      }

      <span style="color: #D0372D;">@Override</span>
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">toString</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #008000;">"City [id="</span> + id + <span style="color: #008000;">", name="</span> + name + <span style="color: #008000;">", latitude="</span> + latitude
              + <span style="color: #008000;">", longitude="</span> + longitude + <span style="color: #008000;">"]"</span>;
      }
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">TODO hashCode() &amp; equals()</span>
  }

</pre>
</div>
<p>
Cette classe doit être liée à une table nommée <code>CITIES</code> avec des
colonnes : 
</p>
<dl class="org-dl">
<dt>ID</dt><dd>clé primaire de type <code>SERIAL</code></dd>
<dt>NAME</dt><dd></dd>

<dt>LATITUDE</dt><dd></dd>

<dt>LONGITUDE</dt><dd></dd>
</dl>


<dl class="org-dl">
<dt>Exercice</dt><dd>Indiquer que la valeur d'une colonne ne doit pas
être <code>NULL</code> et qu'une chaîne de caractères doit avoir une
taille limitée à 255 caractères ?</dd>
</dl>
</div>
</div>
</div>
