session3/cours/java-jpa.md


<a id="org85ed308"></a>

## Annotations

Dans les classes `co.simplon.patrimoine.model.City` et `co.simplon.patrimoine.model.Monument`, on utilisera les annotations suivantes :

-   sur la classe :
    -   [javax.persistence.Entity](https://docs.oracle.com/javaee/6/api/javax/persistence/Entity.html)
    -   [javax.persistence.Table](https://docs.oracle.com/javaee/7/api/javax/persistence/Table.html)
-   sur les attributs :
    -   [javax.persistence.Id](https://docs.oracle.com/javaee/7/api/javax/persistence/Id.html) pour l'attribut correspondant à la clé primaire
    -   [javax.persistence.GeneratedValue](https://docs.oracle.com/javaee/7/api/index.html?javax/persistence/GeneratedValue.html) toujours pour la clé primaire. Avec une valeur de [strategy](https://docs.oracle.com/javaee/7/api/javax/persistence/GeneratedValue.html#strategy--) à [GenerationType.SEQUENCE](https://docs.oracle.com/javaee/7/api/javax/persistence/GenerationType.html#SEQUENCE), dans le cas d'une clé primaire de type `SERIAL` sous postgresql, [notamment pour des raisons de performance](https://www.thoughts-on-java.org/hibernate-postgresql-5-things-need-know/).
    -   [javax.persistence.Column](https://docs.oracle.com/javaee/7/api/javax/persistence/Column.html) pour chacun des attributs.

Sur les classes suivantes :

```java
  public class City {
      private Long id;
      private String name;
      private Double latitude;
      private Double longitude;

      public City() {
      }
      public City(String name, double latitude, double longitude) {
	  this(null, name, latitude, longitude);
      }
      public City(Long id, String name, double latitude, double longitude) {
	  this.id= id;
	  this.name= name;
	  this.latitude= latitude;
	  this.longitude= longitude;
      }
      public Long getId() {
	  return id;
      }

      public void setId(Long id) {
	  this.id = id;
      }

      public String getName() {
	  return name;
      }

      public void setName(String nom) {
	  this.name = nom;
      }

      public Double getLongitude() {
	  return this.longitude;
      }

      public void setLongitude(Double longitude) {
	  this.longitude = longitude;
      }

      public Double getLatitude() {
	  return this.latitude;
      }

      public void setLatitude(Double latitude) {
	  this.latitude = latitude;
      }

      @Override
      public String toString() {
	  return "City [id=" + id + ", name=" + name + ", latitude=" + latitude
	      + ", longitude=" + longitude + "]";
      }
      // TODO hashCode() & equals()
  }

```

Cette classe doit être liée à une table nommée `CITIES` avec des colonnes :

-   **ID:** clé primaire de type `SERIAL`
-   **NAME:** 

-   **LATITUDE:** 

-   **LONGITUDE:** 

-   **Exercice:** Indiquer que la valeur d'une colonne ne doit pas être `NULL` et qu'une chaîne de caractères doit avoir une taille limitée à 255 caractères ?
