session3/cours/java-jpa.org
** Construction d'un EntityManager

Au lieu d'utiliser directement des objets de type [[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html][java.sql.Connection]],
on interagit désormais avec la base de données à travers des objets de
type [[https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html][javax.persistence.EntityManager]]. Pour construire un tel objet en
prenant en compte les propriétés définies dans le fichier
=persistence.xml=, on utilise une
[[https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManagerFactory.html][javax.persistence.EntityManagerFactory]]. Lorsque l'on récupère cet
objet /factory/, on indique le nom de la =persistence-unit= définie
dans le fichier =persistence.xml= ainsi qu'une éventuelle table
d'association qui permet de redéfinir certaines valeurs à l'exécution,
par exemple les informations confidentielles :

#+BEGIN_SRC java
String persistenceUnitName= "demo-jpa-1"; // defined in persistence.xml
Map<String, String> env = System.getenv();
Map<String, Object> configOverrides = new HashMap<String, Object>();
for (String envName : env.keySet()) {
  if (envName.contains("DB_USER")) {
    configOverrides.put("javax.persistence.jdbc.user", env.get(envName));
  }
  if (envName.contains("DB_PASS")) {
    configOverrides.put("javax.persistence.jdbc.password", env.get(envName));
  }
  if (envName.contains("DB_URL")) {
    configOverrides.put("javax.persistence.jdbc.url", env.get(envName));    
  }
}
EntityManagerFactory entityManagerFactory = Persistence.createEntityManagerFactory(persistenceUnitName
                                            ,configOverrides);
#+END_SRC

(Si besoin, [[https://stackoverflow.com/a/13854580][ajuster la configuration d'Eclipse pour qu'il reconnaisse
le contenu du fichier persistence.xml]]).

** Utilisation d'EntityManager
On peut utiliser l'objet de type =EntityManager= pour insérer un
nouvel objet dans la table avec un appel à la méthode [[https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#persist-java.lang.Object-][persist]].

- Exercice :: vérifier la valeur de l'attribut =id= avant et après
              l'appel à =persist=.
*** Création
#+BEGIN_SRC java
  public City createCity() {
      EntityManager em= factory.createEntityManager();
      City city= new City("Atlantis", 0, 0.5);
      city= create(em, city);
      em.close();
      return city;
  }
  public City create(EntityManager em, City city) {
      em.getTransaction().begin();
      em.persist(city);
      em.getTransaction().commit();
      return city;
  }
#+END_SRC
Une fois l'instance de la classe entité passée en argument à
=persist=, celle-ci devient gérée (/managed/) par l'=EntityManager=.
Ensuite, toutes modifications des attributs de l'objet effectuée avant
l'appel à =commit= de l'=EntityManager= sera automatiquement répercutée :
#+BEGIN_SRC java
  public City createCityAndUpdate() {
	  EntityManager em= factory.createEntityManager();
	  City city= new City("Paris", 0, 0.5);
	  em.getTransaction().begin();
	  em.persist(city);
	  city.setLatitude(1000.);
	  em.getTransaction().commit();// MAGIC HAPPENS HERE !
	  em.close();
	  return city;
  }
#+END_SRC

- Exercice :: Observer le résultat de la gestion automatique dans la
              base de donnée.

