session3/cours/java-jpa.html

<div id="outline-container-orge55d48b" class="outline-2">
<h2 id="orge55d48b"><span class="section-number-2">4</span> Utilisation</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9ecd23e" class="outline-3">
<h3 id="org9ecd23e"><span class="section-number-3">4.1</span> Construction d'un EntityManager</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Au lieu d'utiliser directement des objets de type <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html">java.sql.Connection</a>,
on interagit désormais avec la base de données à travers des objets de
type <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html">javax.persistence.EntityManager</a>. Pour construire un tel objet en
prenant en compte les propriétés définies dans le fichier
<code>persistence.xml</code>, on utilise une
<a href="https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManagerFactory.html">javax.persistence.EntityManagerFactory</a>. Lorsque l'on récupère cet
objet <i>factory</i>, on indique le nom de la <code>persistence-unit</code> définie
dans le fichier <code>persistence.xml</code> ainsi qu'une éventuelle table
d'association (<a href="https://docs.oracle.com/javase/9/docs/api/java/util/Map.html">Map</a>)qui permet de redéfinir certaines valeurs à
l'exécution, par exemple les informations confidentielles :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">persistenceUnitName</span>= <span style="color: #008000;">"demo-jpa-1"</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">defined in persistence.xml</span>
<span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">env</span> = System.getenv();
<span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Object</span>&gt; <span style="color: #BA36A5;">configOverrides</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Object</span>&gt;();
<span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">String</span> <span style="color: #006699;">envName</span> : env.keySet()) {
  <span style="color: #0000FF;">if</span> (envName.contains(<span style="color: #008000;">"DB_USER"</span>)) {
    configOverrides.put(<span style="color: #008000;">"javax.persistence.jdbc.user"</span>, env.get(envName));
  }
  <span style="color: #0000FF;">if</span> (envName.contains(<span style="color: #008000;">"DB_PASS"</span>)) {
    configOverrides.put(<span style="color: #008000;">"javax.persistence.jdbc.password"</span>, env.get(envName));
  }
  <span style="color: #0000FF;">if</span> (envName.contains(<span style="color: #008000;">"DB_URL"</span>)) {
    configOverrides.put(<span style="color: #008000;">"javax.persistence.jdbc.url"</span>, env.get(envName));    
  }
}
<span style="color: #6434A3;">EntityManagerFactory</span> <span style="color: #BA36A5;">entityManagerFactory</span> = Persistence.createEntityManagerFactory(persistenceUnitName
                                            ,configOverrides);
</pre>
</div>

<p>
(Si besoin, <a href="https://stackoverflow.com/a/13854580">ajuster la configuration d'Eclipse pour qu'il reconnaisse
le contenu du fichier persistence.xml</a>).
</p>
</div>
</div>

<div id="outline-container-org9256861" class="outline-3">
<h3 id="org9256861"><span class="section-number-3">4.2</span> Utilisation d'EntityManager</h3>
<div class="outline-text-3" id="text-4-2">
<p>
On peut utiliser l'objet de type <code>EntityManager</code> pour insérer un
nouvel objet dans la table avec un appel à la méthode <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#persist-java.lang.Object-">persist</a>.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>vérifier la valeur de l'attribut <code>id</code> avant et après
l'appel à <code>persist</code>.</dd>
</dl>
</div>
<div id="outline-container-orgb9a5ef2" class="outline-4">
<h4 id="orgb9a5ef2"><span class="section-number-4">4.2.1</span> Création</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
On peut créer une class <code class="src src-java">Main</code> avec l'
<code class="src src-java">EntityManagerFactory</code> en attribut (ici
<code class="src src-java">factory</code>) <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> :
</p>

<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">createCity</span>() {
      <span style="color: #6434A3;">EntityManager</span> <span style="color: #BA36A5;">em</span>= factory.createEntityManager();
      <span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>= <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">City</span>(<span style="color: #008000;">"Atlantis"</span>, 0, 0.5);
      city= create(em, city);
      em.close();
      <span style="color: #0000FF;">return</span> city;
  }
  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">create</span>(<span style="color: #6434A3;">EntityManager</span> <span style="color: #BA36A5;">em</span>, <span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>) {
      em.getTransaction().begin();
      em.persist(city);
      em.getTransaction().commit();
      <span style="color: #0000FF;">return</span> city;
  }
</pre>
</div>
<p>
Une fois l'instance de la classe entité passée en argument à
<code>persist</code>, celle-ci devient gérée (<i>managed</i>) par l'<code>EntityManager</code>.
Ensuite, toutes modifications des attributs de l'objet effectuée avant
l'appel à <code>commit</code> de l'<code>EntityManager</code> sera automatiquement répercutée :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">createCityAndUpdate</span>() {
          <span style="color: #6434A3;">EntityManager</span> <span style="color: #BA36A5;">em</span>= factory.createEntityManager();
          <span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>= <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">City</span>(<span style="color: #008000;">"Paris"</span>, 0, 0.5);
          em.getTransaction().begin();
          em.persist(city);
          city.setLatitude(1000.);
          em.getTransaction().commit();<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">MAGIC HAPPENS HERE !</span>
          em.close();
          <span style="color: #0000FF;">return</span> city;
  }
</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Observer le résultat de la gestion automatique dans la
base de donnée.</dd>
</dl>
</div>
</div>
</div>
