session3/cours/java-jpa.org
** Lecture
On peut lire directement une entité à partir de l'=EntityManager= à
partir de la valeur de la clé primaire :
#+BEGIN_SRC java
  public City readCity() {
      EntityManager em= factory.createEntityManager();
      City city= readCity(em, 4L);
      em.close();
      return city;
  }
  public City readCity(EntityManager em, Long id) {
      return em.find(City.class, id);
  }
#+END_SRC

- Exercice :: Que se passe-t-il si l'on change un attribut de l'objet
              lu ? Et si l'on effectue une transaction ensuite ?

** Mise à jour
Lorsqu'on s'attend à ce qu'un objet soit déjà présent dans la base
(l'attribut correspondant à la clé primaire doit donc avoir une
valeur), et que l'on veut, le cas échéant récupérer une référence sur
un objet géré par la base sans confier la gestion de l'objet passé en
argument à l'=EntityManager=, on utilise =merge= plutôt que =persist=.


#+BEGIN_SRC java
  public City updateCity() {
      return update(new City(4L,"PaRiS", -1., -2.));
  }
  public City update(City city) {
      EntityManager em= factory.createEntityManager();
      em.getTransaction().begin();
      city = em.merge(city);
      em.getTransaction().commit();
      return city;
  }
#+END_SRC

- Exercice :: Constater si l'instance retournée par =merge= est gérée
              (/managed/).

** Suppression
On peut vouloir supprimer un objet selon deux cas de figures :
- à partir de la valeur de la clé primaire
- à partir d'une instance de la classe entité

- Exercice :: Implémenter les deux cas de figure à l'aide de la
              méthode [[https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#remove-java.lang.Object-][remove]] de l'=EntityManager=. Dans le deuxième
              cas de figure, prendre en compte que l'instance passé en
              argument doit être /gérée/ par l'=EntityManager=.


* Pratique

Implémenter les mêmes fonctionnalités pour une classe =Monument= :
#+BEGIN_SRC java
  public class Monument {
      private Long id;
      private String name;

      /* TODO
	  private City city;
      ,*/
      public Monument(String name) {
	  super();
	  this.name = name;
      }
      public Monument() {
      }
      public Long getId() {
	  return this.id;
      }
      public void setId(Long id) {
	  this.id = id;
      }
      public String getName() {
	  return this.name;
      }
      public void setName(String name) {
	  this.name = name;
      }
      /*
      public City getCity() {
	  return city;
      }
    
      public void setCity(City city) {
	  this.city = city;
      }
      ,*/
      @Override
      public String toString() {
	  return "Monument [id=" + id + ", name=" + name
	      + ", city=" /*+ city */+ "]";
      }
  }
#+END_SRC
* Associations

