session3/cours/java-jpa.html

<div id="outline-container-orgcb9f89f" class="outline-3">
<h3 id="orgcb9f89f"><span class="section-number-3">4.3</span> Lecture</h3>
<div class="outline-text-3" id="text-4-3">
<p>
On peut lire directement une entité à partir de l'<code>EntityManager</code> à
partir de la valeur de la clé primaire :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">readCity</span>() {
      <span style="color: #6434A3;">EntityManager</span> <span style="color: #BA36A5;">em</span>= factory.createEntityManager();
      <span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>= readCity(em, 4L);
      em.close();
      <span style="color: #0000FF;">return</span> city;
  }
  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">readCity</span>(<span style="color: #6434A3;">EntityManager</span> <span style="color: #BA36A5;">em</span>, <span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>) {
      <span style="color: #0000FF;">return</span> em.find(City.<span style="color: #0000FF;">class</span>, id);
  }
</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Que se passe-t-il si l'on change un attribut de l'objet
lu ? Et si l'on effectue une transaction ensuite ?</dd>
</dl>
</div>
</div>

<div id="outline-container-orgefe6dfa" class="outline-3">
<h3 id="orgefe6dfa"><span class="section-number-3">4.4</span> Mise à jour</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Lorsqu'on s'attend à ce qu'un objet soit déjà présent dans la base
(l'attribut correspondant à la clé primaire doit donc avoir une
valeur), et que l'on veut, le cas échéant récupérer une référence sur
un objet géré par la base sans confier la gestion de l'objet passé en
argument à l'<code>EntityManager</code>, on utilise <code>merge</code> plutôt que <code>persist</code>.
</p>


<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">updateCity</span>() {
      <span style="color: #0000FF;">return</span> update(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">City</span>(4L,<span style="color: #008000;">"PaRiS"</span>, -1., -2.));
  }
  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">update</span>(<span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>) {
      <span style="color: #6434A3;">EntityManager</span> <span style="color: #BA36A5;">em</span>= factory.createEntityManager();
      em.getTransaction().begin();
      city = em.merge(city);
      em.getTransaction().commit();
      <span style="color: #0000FF;">return</span> city;
  }
</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Constater si l'instance retournée par <code>merge</code> est gérée
(<i>managed</i>).</dd>
</dl>
</div>
</div>

<div id="outline-container-org1dba4b6" class="outline-3">
<h3 id="org1dba4b6"><span class="section-number-3">4.5</span> Suppression</h3>
<div class="outline-text-3" id="text-4-5">
<p>
On peut vouloir supprimer un objet selon deux cas de figures :
</p>
<ul class="org-ul">
<li>à partir de la valeur de la clé primaire</li>
<li>à partir d'une instance de la classe entité</li>

<li id="Exercice">Implémenter les deux cas de figure à l'aide de la
méthode <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#remove-java.lang.Object-">remove</a> de l'<code>EntityManager</code>. Dans le deuxième
cas de figure, prendre en compte que l'instance passé en
argument doit être <i>gérée</i> par l'<code>EntityManager</code>.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org6b71149" class="outline-2">
<h2 id="org6b71149"><span class="section-number-2">5</span> Pratique</h2>
<div class="outline-text-2" id="text-5">
<p>
Implémenter les mêmes fonctionnalités pour une classe <code>Monument</code> :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Monument</span> {
      <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>;
      <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>;

      <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">TODO</span>
<span style="color: #8D8D84; font-style: italic;">          private City city;</span>
<span style="color: #8D8D84; font-style: italic;">      */</span>
      <span style="color: #0000FF;">public</span> <span style="color: #006699;">Monument</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
          <span style="color: #0000FF;">super</span>();
          <span style="color: #0000FF;">this</span>.name = name;
      }
      <span style="color: #0000FF;">public</span> <span style="color: #006699;">Monument</span>() {
      }
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">Long</span> <span style="color: #006699;">getId</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">this</span>.id;
      }
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setId</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>) {
          <span style="color: #0000FF;">this</span>.id = id;
      }
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">getName</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">this</span>.name;
      }
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setName</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
          <span style="color: #0000FF;">this</span>.name = name;
      }
      <span style="color: #8D8D84;">/*</span>
<span style="color: #8D8D84; font-style: italic;">      public City getCity() {</span>
<span style="color: #8D8D84; font-style: italic;">          return city;</span>
<span style="color: #8D8D84; font-style: italic;">      }</span>
<span style="color: #8D8D84; font-style: italic;">    </span>
<span style="color: #8D8D84; font-style: italic;">      public void setCity(City city) {</span>
<span style="color: #8D8D84; font-style: italic;">          this.city = city;</span>
<span style="color: #8D8D84; font-style: italic;">      }</span>
<span style="color: #8D8D84; font-style: italic;">      */</span>
      <span style="color: #D0372D;">@Override</span>
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">toString</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #008000;">"Monument [id="</span> + id + <span style="color: #008000;">", name="</span> + name
              + <span style="color: #008000;">", city="</span> <span style="color: #8D8D84;">/*</span><span style="color: #8D8D84; font-style: italic;">+ city */</span>+ <span style="color: #008000;">"]"</span>;
      }
  }
</pre>
</div>
</div>
</div>
