session3/cours/java-jpa.org
** 1-N, N-1
On va vouloir modéliser une association entre :
- un monument et une ville
- une ville et des monuments

Au niveau des entités, on peut ajouter des attributs (et accesseurs
qui vont avec) :
- dans la classe =Monument= :
  #+BEGIN_SRC java
  private City city;
  #+END_SRC
- dans la classe =City= :
  #+BEGIN_SRC java
  private List<Monument> monuments = new ArrayList<Monument>();
  #+END_SRC

Remarque : On peut [[https://www.thoughts-on-java.org/association-mappings-bag-list-set/][utiliser d'autres types de Collection que List]].

Au niveau de la base de données, il suffirait d'avoir une colonne
=city= (ou =fk_city= suivant la convention de nommage) comme clé
étrangère.

On peut indiquer cela avec les annotations suivantes :
#+BEGIN_SRC java
@ManyToOne(fetch = FetchType.LAZY)
@JoinColumn(name = "city")
private City city;
#+END_SRC

et
#+BEGIN_SRC java
@OneToMany(mappedBy = "city")
private List<Monument> monuments = new ArrayList<Monument>();
#+END_SRC

- Exercices :: [[https://www.thoughts-on-java.org/entity-mappings-introduction-jpa-fetchtypes/][Quel est l'effet]] de =fetch = FetchType.Lazy= ?

Quel seraient les effets du codes suivant ?
#+BEGIN_SRC java
@OneToMany(mappedBy = "city", cascade = CascadeType.ALL, orphanRemoval = true, fetch = FetchType.LAZY)
private Set<Monument> monuments;
#+END_SRC

- Exercice :: Modifier la méthode =createMonument= du programme principal pour créer un monument qui soit rattaché à une ville.

