session3/cours/java-jpa.html
<div id="outline-container-org45594d5" class="outline-2">
<h2 id="org45594d5"><span class="section-number-2">6</span> Associations</h2>
<div class="outline-text-2" id="text-6">
<p>
On peut <a href="https://thoughts-on-java.org/ultimate-guide-association-mappings-jpa-hibernate/">utiliser JPA pour modéliser tous types d'associations</a>.
</p>
</div>

<div id="outline-container-org601c05f" class="outline-3">
<h3 id="org601c05f"><span class="section-number-3">6.1</span> 1-N, N-1</h3>
<div class="outline-text-3" id="text-6-1">
<p>
On va vouloir modéliser une association entre :
</p>
<ul class="org-ul">
<li>un monument et une ville</li>
<li>une ville et des monuments</li>
</ul>

<p>
Au niveau des entités, on peut ajouter des attributs (et accesseurs
qui vont avec) :
</p>
<ul class="org-ul">
<li><p>
dans la classe <code>Monument</code> :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>;
</pre>
</div></li>
<li><p>
dans la classe <code>City</code> :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">Monument</span>&gt; <span style="color: #BA36A5;">monuments</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">Monument</span>&gt;();
</pre>
</div></li>
</ul>

<p>
Remarque : On peut <a href="https://www.thoughts-on-java.org/association-mappings-bag-list-set/">utiliser d'autres types de Collection que List</a>.
</p>

<p>
Au niveau de la base de données, il suffirait d'avoir une colonne
<code>city</code> (ou <code>fk_city</code> suivant la convention de nommage) comme clé
étrangère.
</p>

<p>
On peut indiquer cela avec les annotations suivantes :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #D0372D;">@ManyToOne</span>(fetch = <span style="color: #D0372D;">FetchType</span>.LAZY)
<span style="color: #D0372D;">@JoinColumn</span>(name = <span style="color: #008000;">"city"</span>)
<span style="color: #0000FF;">private</span> <span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>;
</pre>
</div>

<p>
et
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #D0372D;">@OneToMany</span>(mappedBy = <span style="color: #008000;">"city"</span>)
<span style="color: #0000FF;">private</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">Monument</span>&gt; <span style="color: #BA36A5;">monuments</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">Monument</span>&gt;();
</pre>
</div>

<dl class="org-dl">
<dt>Exercices</dt><dd><a href="https://www.thoughts-on-java.org/entity-mappings-introduction-jpa-fetchtypes/">Quel est l'effet</a> de <code>fetch = FetchType.Lazy</code> ?</dd>
</dl>

<p>
Quel seraient les effets du codes suivant ?
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #D0372D;">@OneToMany</span>(mappedBy = <span style="color: #008000;">"city"</span>, cascade = <span style="color: #D0372D;">CascadeType</span>.ALL, orphanRemoval = <span style="color: #D0372D;">true</span>, fetch = <span style="color: #D0372D;">FetchType</span>.LAZY)
<span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Set</span>&lt;<span style="color: #6434A3;">Monument</span>&gt; <span style="color: #BA36A5;">monuments</span>;
</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Modifier la méthode <code>createMonument</code> du programme principal pour créer un monument qui soit rattaché à une ville.</dd>
</dl>
</div>
</div>
