session3/cours/java-jpa.md


<a id="orgbcca5dc"></a>

# Associations

On peut [utiliser JPA pour modéliser tous types d'associations](https://thoughts-on-java.org/ultimate-guide-association-mappings-jpa-hibernate/).


<a id="orgda0bc05"></a>

## 1-N, N-1

On va vouloir modéliser une association entre :

-   un monument et une ville
-   une ville et des monuments

Au niveau des entités, on peut ajouter des attributs (et accesseurs qui vont avec) :

-   dans la classe `Monument` :
    
    ```java
      private City city;
    ```
-   dans la classe `City` :
    
    ```java
      private List<Monument> monuments = new ArrayList<Monument>();
    ```

Remarque : On peut [utiliser d'autres types de Collection que List](https://www.thoughts-on-java.org/association-mappings-bag-list-set/).

Au niveau de la base de données, il suffirait d'avoir une colonne `city` (ou `fk_city` suivant la convention de nommage) comme clé étrangère.

On peut indiquer cela avec les annotations suivantes :

```java
@ManyToOne(fetch = FetchType.LAZY)
@JoinColumn(name = "city")
private City city;
```

et

```java
@OneToMany(mappedBy = "city")
private List<Monument> monuments = new ArrayList<Monument>();
```

-   **Exercices:** [Quel est l'effet](https://www.thoughts-on-java.org/entity-mappings-introduction-jpa-fetchtypes/) de `fetch = FetchType.Lazy` ?

Quel seraient les effets du codes suivant ?

```java
@OneToMany(mappedBy = "city", cascade = CascadeType.ALL, orphanRemoval = true, fetch = FetchType.LAZY)
private Set<Monument> monuments;
```

-   **Exercice:** Modifier la méthode `createMonument` du programme principal pour créer un monument qui soit rattaché à une ville.
