session3/cours/java-jpa.html

<div id="outline-container-org441089a" class="outline-3">
<h3 id="org441089a"><span class="section-number-3">6.2</span> N-N</h3>
<div class="outline-text-3" id="text-6-2">
<p>
On va ajouter une classe <code>User</code> qui permettra de modéliser des
utilisateurs de notre application. Chaque utilisateur peut avoir
visité plusieurs monuments et chaque monument peut avoir été visité
par plusieurs utilisateurs.
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">HashSet</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Set</span>;

<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">Column</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">Entity</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">GeneratedValue</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">GenerationType</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">Id</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">JoinTable</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">JoinColumn</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">ManyToMany</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">javax</span>.<span style="color: #D0372D;">persistence</span>.<span style="color: #6434A3;">Table</span>;

<span style="color: #D0372D;">@Entity</span>
<span style="color: #D0372D;">@Table</span>(name = <span style="color: #008000;">"USERS"</span>)
<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">User</span> {

        <span style="color: #D0372D;">@Id</span>
        <span style="color: #D0372D;">@GeneratedValue</span>(strategy = <span style="color: #D0372D;">GenerationType</span>.IDENTITY)
        <span style="color: #D0372D;">@Column</span>(name = <span style="color: #008000;">"ID"</span>)
        <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>;

        <span style="color: #D0372D;">@Column</span>(name = <span style="color: #008000;">"NAME"</span>, nullable = <span style="color: #D0372D;">false</span>, length = 100)
        <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>;
        
        <span style="color: #D0372D;">@ManyToMany</span>
        <span style="color: #D0372D;">@JoinTable</span>(name= <span style="color: #008000;">"USER_MONUMENT"</span>,
                   joinColumns = {<span style="color: #D0372D;">@JoinColumn</span>(name = <span style="color: #008000;">"FK_USER"</span>, referencedColumnName= <span style="color: #008000;">"ID"</span> ) },
                   inverseJoinColumns = { <span style="color: #D0372D;">@JoinColumn</span>(name = <span style="color: #008000;">"FK_MONUMENT"</span>, referencedColumnName= <span style="color: #008000;">"ID"</span>) })
        <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Set</span>&lt;<span style="color: #6434A3;">Monument</span>&gt; <span style="color: #BA36A5;">monuments</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashSet</span>&lt;<span style="color: #6434A3;">Monument</span>&gt;();
        
        <span style="color: #0000FF;">public</span> <span style="color: #006699;">User</span>() {
        }
        <span style="color: #0000FF;">public</span> <span style="color: #006699;">User</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
                <span style="color: #0000FF;">this</span>.name= name;
        }
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">getName</span>() {
                <span style="color: #0000FF;">return</span> name;
        }
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setName</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>) {
                <span style="color: #0000FF;">this</span>.name= name;
        }
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">addMonument</span>(<span style="color: #6434A3;">Monument</span> <span style="color: #BA36A5;">m</span>){
                monuments.add(m);
                m.getUsers().add(<span style="color: #0000FF;">this</span>);
        }
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">Set</span>&lt;<span style="color: #6434A3;">Monument</span>&gt; <span style="color: #006699;">getMonuments</span>(){
                <span style="color: #0000FF;">return</span> monuments;
        }
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setMonuments</span>(<span style="color: #6434A3;">Set</span>&lt;<span style="color: #6434A3;">Monument</span>&gt; <span style="color: #BA36A5;">monuments</span>) {
                <span style="color: #0000FF;">this</span>.monuments= monuments;
        }
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">toString</span>() {
                <span style="color: #0000FF;">return</span> <span style="color: #008000;">"User :{ id= "</span>+id+<span style="color: #008000;">"\n name= "</span>+name+<span style="color: #008000;">"\n nb momunents"</span>+ monuments.size()+<span style="color: #008000;">"\n}"</span>;
        }
        
}
</pre>
</div>

<p>
Et en ajoutant dans la classe <code>Monument</code> l'attribut annoté suivant (et ses accesseurs) :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #D0372D;">@ManyToMany</span>(mappedBy=<span style="color: #008000;">"monuments"</span>)
  <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Set</span>&lt;<span style="color: #6434A3;">User</span>&gt; <span style="color: #BA36A5;">users</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashSet</span>&lt;<span style="color: #6434A3;">User</span>&gt;();
</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Implémenter un méthode <code>createUser</code> .</dd>
</dl>
</div>
</div>
</div>
