session3/cours/java-jpa.md


<a id="org29ad975"></a>

## N-N

On va ajouter une classe `User` qui permettra de modéliser des utilisateurs de notre application. Chaque utilisateur peut avoir visité plusieurs monuments et chaque monument peut avoir été visité par plusieurs utilisateurs.

```java

import java.util.HashSet;
import java.util.Set;

import javax.persistence.Column;
import javax.persistence.Entity;
import javax.persistence.GeneratedValue;
import javax.persistence.GenerationType;
import javax.persistence.Id;
import javax.persistence.JoinTable;
import javax.persistence.JoinColumn;
import javax.persistence.ManyToMany;
import javax.persistence.Table;

@Entity
@Table(name = "USERS")
public class User {

	@Id
	@GeneratedValue(strategy = GenerationType.IDENTITY)
	@Column(name = "ID")
	private Long id;

	@Column(name = "NAME", nullable = false, length = 100)
	private String name;
	
	@ManyToMany
        @JoinTable(name= "USER_MONUMENT",
                   joinColumns = {@JoinColumn(name = "FK_USER", referencedColumnName= "ID" ) },
                   inverseJoinColumns = { @JoinColumn(name = "FK_MONUMENT", referencedColumnName= "ID") })
        private Set<Monument> monuments = new HashSet<Monument>();
	
	public User() {
	}
	public User(String name) {
		this.name= name;
	}
	public String getName() {
		return name;
	}
	public void setName(String name) {
		this.name= name;
	}
	public void addMonument(Monument m){
		monuments.add(m);
		m.getUsers().add(this);
	}
	public Set<Monument> getMonuments(){
		return monuments;
	}
	public void setMonuments(Set<Monument> monuments) {
		this.monuments= monuments;
	}
	public String toString() {
		return "User :{ id= "+id+"\n name= "+name+"\n nb momunents"+ monuments.size()+"\n}";
	}
	
}
```

Et en ajoutant dans la classe `Monument` l'attribut annoté suivant (et ses accesseurs) :

```java
  @ManyToMany(mappedBy="monuments")
  private Set<User> users = new HashSet<User>();
```

-   **Exercice:** Implémenter un méthode `createUser` .
