session3/cours/java-jpa.html


<div id="outline-container-org8182b56" class="outline-2">
<h2 id="org8182b56"><span class="section-number-2">7</span> Data Access Objects</h2>
<div class="outline-text-2" id="text-7">
<p>
Implémenter les DAOs selon les interfaces suivantes :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">interface</span> <span style="color: #6434A3;">MonumentDao</span> {
      <span style="color: #6434A3;">Monument</span> <span style="color: #006699;">createMonument</span>(<span style="color: #6434A3;">Monument</span> <span style="color: #BA36A5;">monument</span>);
      <span style="color: #6434A3;">Monument</span> <span style="color: #006699;">getMonumentById</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>);
      <span style="color: #6434A3;">Monument</span> <span style="color: #006699;">updateMonument</span>(<span style="color: #6434A3;">Monument</span> <span style="color: #BA36A5;">monument</span>);
      <span style="color: #6434A3;">void</span> <span style="color: #006699;">deleteMonumentById</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>);
  }
</pre>
</div>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">interface</span> <span style="color: #6434A3;">CityDao</span> {
      <span style="color: #6434A3;">City</span> <span style="color: #006699;">createCity</span>(<span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>);
      <span style="color: #6434A3;">City</span> <span style="color: #006699;">getCityById</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>);
      <span style="color: #6434A3;">City</span> <span style="color: #006699;">updateCity</span>(<span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span>);
      <span style="color: #6434A3;">void</span> <span style="color: #006699;">deleteCityById</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>);
  }
</pre>
</div>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">interface</span> <span style="color: #6434A3;">UserDao</span> {
      <span style="color: #6434A3;">User</span> <span style="color: #006699;">createUser</span>(<span style="color: #6434A3;">User</span> <span style="color: #BA36A5;">user</span>);
      <span style="color: #6434A3;">User</span> <span style="color: #006699;">getUserById</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>);
      <span style="color: #6434A3;">User</span> <span style="color: #006699;">updateUser</span>(<span style="color: #6434A3;">User</span> <span style="color: #BA36A5;">user</span>);
      <span style="color: #6434A3;">void</span> <span style="color: #006699;">deleteUserById</span>(<span style="color: #6434A3;">Long</span> <span style="color: #BA36A5;">id</span>);
  }
</pre>
</div>

<dl class="org-dl">
<dt>Exercices</dt><dd><ul class="org-ul">
<li>Factoriser les interfaces avec une interface <i>générique</i>.</li>
<li>Factoriser les implémentations avec une classe de base
<i>générique</i>.</li>
</ul></dd>
</dl>


<p>
Bien sûr, les méthodes <code>find</code>, <code>persist</code>, <code>merge</code> et <code>remove</code> ne
suffisent pas à interagir avec la base de données. <a href="https://www.thoughts-on-java.org/jpa-native-queries/">Il est possible
d'utiliser l'EntityManager pour effectuer des requêtes SQL</a> avec la
méthode <a href="http://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#createNativeQuery-java.lang.String-">createNativeQuery</a>. Cependant, on pourra tirer un parti plus
avantageux des correspondances classes / tables, attributs / colonnes,
objets / lignes en écrivant des requêtes manipulant des classes,
attributs et objets plutôt que des tables, colonnes et tuples avec un
nouveau <i>DSL</i> (<i>Domain Specific Language</i>).
</p>
</div>
</div>

<div id="outline-container-org0365eff" class="outline-2">
<h2 id="org0365eff"><span class="section-number-2">8</span> Java Persistence Query Language</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://www.thoughts-on-java.org/jpql/">JPQL reprend exactement les principes de SQL</a> et l'on peut passer une
<code>String</code> de code <code>JPQL</code> en argument à la méthode <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#createQuery-java.lang.String-">createQuery</a> de
l'objet <code>EntityManager</code> de ma même façon qu'on utilisait par exemple
la méthode <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#execute(java.lang.String)">execute</a> d'un objet <code>java.sql.Statement</code>. Ainsi, pour lister
tous les monuments en les triant dans l'ordre alphabétique, le code
JPQL sera :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #008000;">" SELECT m FROM Monument m ORDER BY m.nom "</span>
</pre>
</div>
</div>

<div id="outline-container-org9e5bf28" class="outline-3">
<h3 id="org9e5bf28"><span class="section-number-3">8.1</span> Paramétrage</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Il est bien sûr aussi possible de paramétrer les requêtes <i>JQPL</i>. On
peut utiliser deux types de paramètres :
</p>

<dl class="org-dl">
<dt>positionnels</dt><dd><p>
Ils sont indiqué dans la requête <i>JPQL</i> sous la
forme <code>?1</code>, <code>?2</code> …
</p>
<div class="org-src-container">
<pre class="src src-java">                  <span style="color: #008000;">"SELECT c FROM City AS c WHERE c.name=?1"</span>
</pre>
</div></dd>
<dt>nommés</dt><dd><p>
Ils sont indiqués dans la requête <i>JPQL</i> sous la forme <code>:nom</code> :
</p>
<div class="org-src-container">
<pre class="src src-java">            <span style="color: #008000;">"SELECT c FROM City AS c WHERE c.name=:nameParam"</span>
</pre>
</div></dd>
</dl>

<p>
Un appel à la méthode <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/Query.html#setParameter-int-java.lang.Object-">setParameter</a> prenant un <code>int</code> en premier
argument ou à <a href="https://docs.oracle.com/javaee/7/api/javax/persistence/Query.html#setParameter-java.lang.String-java.lang.Object-">setParameter</a> prenant une chaîne de caractères (le nom
<b>sans</b> le préfixe ':') en premier argument permet d'assigner une
valeur à un paramètre avant d'exécuter la requête.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Utiliser des requêtes JPQL, notamment en explorant les
<a href="https://www.objectdb.com/java/jpa/query/jpql/string#LIKE___String_Pattern_Matching_with_Wildcards_">opérateurs sur les chaînes de caractères</a> plutôt qu'une
simple égalité.</dd>
</dl>
</div>
</div>
