session3/cours/java-jpa.md


<a id="orgca40791"></a>

# Data Access Objects

Implémenter les DAOs selon les interfaces suivantes :

```java
  public interface MonumentDao {
      Monument createMonument(Monument monument);
      Monument getMonumentById(Long id);
      Monument updateMonument(Monument monument);
      void deleteMonumentById(Long id);
  }
```

```java
  public interface CityDao {
      City createCity(City city);
      City getCityById(Long id);
      City updateCity(City city);
      void deleteCityById(Long id);
  }
```

```java
  public interface UserDao {
      User createUser(User user);
      User getUserById(Long id);
      User updateUser(User user);
      void deleteUserById(Long id);
  }
```

-   **Exercices:** -   Factoriser les interfaces avec une interface *générique*.
    -   Factoriser les implémentations avec une classe de base *générique*.

Bien sûr, les méthodes `find`, `persist`, `merge` et `remove` ne suffisent pas à interagir avec la base de données. [Il est possible d'utiliser l'EntityManager pour effectuer des requêtes SQL](https://www.thoughts-on-java.org/jpa-native-queries/) avec la méthode [createNativeQuery](http://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#createNativeQuery-java.lang.String-). Cependant, on pourra tirer un parti plus avantageux des correspondances classes / tables, attributs / colonnes, objets / lignes en écrivant des requêtes manipulant des classes, attributs et objets plutôt que des tables, colonnes et tuples avec un nouveau *DSL* (*Domain Specific Language*).


<a id="org05f53e2"></a>

# Java Persistence Query Language

[JPQL reprend exactement les principes de SQL](https://www.thoughts-on-java.org/jpql/) et l'on peut passer une `String` de code `JPQL` en argument à la méthode [createQuery](https://docs.oracle.com/javaee/7/api/javax/persistence/EntityManager.html#createQuery-java.lang.String-) de l'objet `EntityManager` de ma même façon qu'on utilisait par exemple la méthode [execute](https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html#execute(java.lang.String)) d'un objet `java.sql.Statement`. Ainsi, pour lister tous les monuments en les triant dans l'ordre alphabétique, le code JPQL sera :

```java
" SELECT m FROM Monument m ORDER BY m.nom "
```


<a id="org5455380"></a>

## Paramétrage

Il est bien sûr aussi possible de paramétrer les requêtes *JQPL*. On peut utiliser deux types de paramètres :

-   **positionnels:** Ils sont indiqué dans la requête *JPQL* sous la forme `?1`, `?2` …
    
    ```java
    		  "SELECT c FROM City AS c WHERE c.name=?1"
    ```
-   **nommés:** Ils sont indiqués dans la requête *JPQL* sous la forme `:nom` :
    
    ```java
    	    "SELECT c FROM City AS c WHERE c.name=:nameParam"
    ```

Un appel à la méthode [setParameter](https://docs.oracle.com/javaee/7/api/javax/persistence/Query.html#setParameter-int-java.lang.Object-) prenant un `int` en premier argument ou à [setParameter](https://docs.oracle.com/javaee/7/api/javax/persistence/Query.html#setParameter-java.lang.String-java.lang.Object-) prenant une chaîne de caractères (le nom **sans** le préfixe ':') en premier argument permet d'assigner une valeur à un paramètre avant d'exécuter la requête.

-   **Exercice:** Utiliser des requêtes JPQL, notamment en explorant les [opérateurs sur les chaînes de caractères](https://www.objectdb.com/java/jpa/query/jpql/string#LIKE___String_Pattern_Matching_with_Wildcards_) plutôt qu'une simple égalité.
